app/nvmf_iaa/fio_engine/results_lat/64k_latency.out
=== run_latency.sh ===
timestamp: 2026-04-07 22:42:26
rw: write
cq_size: 32
total_ios: 32
bs: 64k
size: 2097152
fio: /home/xuanboj2/spdk-iaa/app/nvmf_iaa/fio/fio
engine: /home/xuanboj2/spdk-iaa/app/nvmf_iaa/fio_engine/iaanic.so
poll_usleep: 0
job: (g=0): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=snic_phase1, iodepth=1
fio-3.41-142-g698f
Starting 1 thread
EAL: '-c <coremask>' option is deprecated, and will be removed in a future release
EAL: 	Use '-l <corelist>' or '--lcores=<corelist>' option instead
[Init] Probing Target 192.168.200.20:4420...
[Init] Attaching to 192.168.200.20
[Init] Attached to NVMe Controller
[Init] Allocated IO QPair. Negotiated QID: 1
[RDMA] Resolving SNIC address 192.168.200.11:18515...
[RDMA] Resolving route...
[RDMA] Connecting to SNIC...
[RDMA] SNIC Connection established!
[Init] Registering Memory...
[Init] Cleaning IAA Completion Buffer
[Init] Mapping IAA Portal at /dev/iax/wq1.0...
[Init] Allocating COMP/DECOMP AECS buffers
[Init] COMP AECS loaded:   addr=0x72c7b4119240 size=1568
[Init] DECOMP AECS loaded: addr=0x72c7b4131a80 size=5376
[Init] Initing SETUP MSG...
[Init] All systems OK. Staging Buffer: 64 MB (Hugepages)
[Init] Sending SETUP Message to SNIC...
[SETUP] comp_aecs_addr=0x72c7b4119240 comp_aecs_size=1568
[SETUP] decomp_aecs_addr=0x72c7b4131a80 decomp_aecs_size=5376
[Init] SETUP Message Sent successfully.
sizeof(struct snic_setup_msg) = 80

job: (groupid=0, jobs=1): err= 0: pid=21663: Tue Apr  7 22:42:26 2026
  write: IOPS=8000, BW=500MiB/s (524MB/s)(2048KiB/4msec)
    clat (usec): min=86, max=168, avg=95.19, stdev=15.28
     lat (usec): min=87, max=170, avg=96.30, stdev=15.45
    clat percentiles (usec):
     |  1.00th=[   87],  5.00th=[   88], 10.00th=[   89], 20.00th=[   90],
     | 30.00th=[   90], 40.00th=[   91], 50.00th=[   91], 60.00th=[   92],
     | 70.00th=[   93], 80.00th=[   94], 90.00th=[  102], 95.00th=[  128],
     | 99.00th=[  169], 99.50th=[  169], 99.90th=[  169], 99.95th=[  169],
     | 99.99th=[  169]
  lat (usec)   : 100=87.50%, 250=12.50%
  cpu          : usr=66.67%, sys=0.00%, ctx=0, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=500MiB/s (524MB/s), 500MiB/s-500MiB/s (524MB/s-524MB/s), io=2048KiB (2097kB), run=4-4msec