app/nvmf_iaa/fio_engine/results_lat/64k_latency.out
=== run_latency_pair.sh ===
timestamp: 2026-03-26 15:30:50
bs: 64k
size: 64k
fio: /home/xuanboj2/spdk-iaa/app/nvmf_iaa/fio/fio
engine: ./snic_phase1.so

=== WRITE ===
job0: (g=0): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=snic_phase1, iodepth=1
fio-3.41-142-g698f
Starting 1 thread
job0: Laying out IO file (1 file / 0MiB)
EAL: '-c <coremask>' option is deprecated, and will be removed in a future release
EAL: 	Use '-l <corelist>' or '--lcores=<corelist>' option instead
[Init] Probing Target 192.168.200.20:4420...
[Init] Attaching to 192.168.200.20
[Init] Attached to NVMe Controller
[Init] Allocated IO QPair. Negotiated QID: 1
[RDMA] Resolving SNIC address 192.168.200.11:18515...
[RDMA] Resolving route...
[RDMA] Connecting to SNIC...
[RDMA] SNIC Connection established!
[Init] Registering Memory...
[Init] Cleaning IAA Completion Buffer
[Init] Mapping IAA Portal at /dev/iax/wq1.0...
[Init] Allocating COMP/DECOMP AECS buffers
[Init] COMP AECS loaded:   addr=0x77f6e4112040 size=1568
[Init] DECOMP AECS loaded: addr=0x77f6e4119140 size=5376
[Init] Initing SETUP MSG...
[Init] All systems OK. Staging Buffer: 32 MB (Hugepages)
[Init] Sending SETUP Message to SNIC...
[SETUP] comp_aecs_addr=0x77f6e4112040 comp_aecs_size=1568
[SETUP] decomp_aecs_addr=0x77f6e4119140 decomp_aecs_size=5376
[Init] SETUP Message Sent successfully.
sizeof(struct snic_setup_msg) = 80

job0: (groupid=0, jobs=1): err= 0: pid=19408: Thu Mar 26 15:30:51 2026
  write: IOPS=500, BW=31.2MiB/s (32.8MB/s)(64.0KiB/2msec)
    clat (nsec): min=1141.5k, max=1141.5k, avg=1141540.00, stdev= 0.00
     lat (nsec): min=1143.6k, max=1143.6k, avg=1143639.00, stdev= 0.00
    clat percentiles (usec):
     |  1.00th=[ 1139],  5.00th=[ 1139], 10.00th=[ 1139], 20.00th=[ 1139],
     | 30.00th=[ 1139], 40.00th=[ 1139], 50.00th=[ 1139], 60.00th=[ 1139],
     | 70.00th=[ 1139], 80.00th=[ 1139], 90.00th=[ 1139], 95.00th=[ 1139],
     | 99.00th=[ 1139], 99.50th=[ 1139], 99.90th=[ 1139], 99.95th=[ 1139],
     | 99.99th=[ 1139]
  lat (msec)   : 2=100.00%
  cpu          : usr=0.00%, sys=0.00%, ctx=1, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=31.2MiB/s (32.8MB/s), 31.2MiB/s-31.2MiB/s (32.8MB/s-32.8MB/s), io=64.0KiB (65.5kB), run=2-2msec

Disk stats (read/write):
  nvme1n1: ios=0/0, sectors=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%

=== READ ===
job0: (g=0): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=snic_phase1, iodepth=1
fio-3.41-142-g698f
Starting 1 thread
job0: Laying out IO file (1 file / 0MiB)
EAL: '-c <coremask>' option is deprecated, and will be removed in a future release
EAL: 	Use '-l <corelist>' or '--lcores=<corelist>' option instead
[Init] Probing Target 192.168.200.20:4420...
[Init] Attaching to 192.168.200.20
[Init] Attached to NVMe Controller
[Init] Allocated IO QPair. Negotiated QID: 1
[RDMA] Resolving SNIC address 192.168.200.11:18515...
[RDMA] Resolving route...
[RDMA] Connecting to SNIC...
[RDMA] SNIC Connection established!
[Init] Registering Memory...
[Init] Cleaning IAA Completion Buffer
[Init] Mapping IAA Portal at /dev/iax/wq1.0...
[Init] Allocating COMP/DECOMP AECS buffers
[Init] COMP AECS loaded:   addr=0x7c904c112040 size=1568
[Init] DECOMP AECS loaded: addr=0x7c904c119140 size=5376
[Init] Initing SETUP MSG...
[Init] All systems OK. Staging Buffer: 32 MB (Hugepages)
[Init] Sending SETUP Message to SNIC...
[SETUP] comp_aecs_addr=0x7c904c112040 comp_aecs_size=1568
[SETUP] decomp_aecs_addr=0x7c904c119140 decomp_aecs_size=5376
[Init] SETUP Message Sent successfully.
sizeof(struct snic_setup_msg) = 80

job0: (groupid=0, jobs=1): err= 0: pid=19468: Thu Mar 26 15:30:51 2026
  read: IOPS=500, BW=31.2MiB/s (32.8MB/s)(64.0KiB/2msec)
    clat (nsec): min=1178.3k, max=1178.3k, avg=1178266.00, stdev= 0.00
     lat (nsec): min=1179.0k, max=1179.0k, avg=1179005.00, stdev= 0.00
    clat percentiles (usec):
     |  1.00th=[ 1172],  5.00th=[ 1172], 10.00th=[ 1172], 20.00th=[ 1172],
     | 30.00th=[ 1172], 40.00th=[ 1172], 50.00th=[ 1172], 60.00th=[ 1172],
     | 70.00th=[ 1172], 80.00th=[ 1172], 90.00th=[ 1172], 95.00th=[ 1172],
     | 99.00th=[ 1172], 99.50th=[ 1172], 99.90th=[ 1172], 99.95th=[ 1172],
     | 99.99th=[ 1172]
  lat (msec)   : 2=100.00%
  cpu          : usr=0.00%, sys=0.00%, ctx=1, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=31.2MiB/s (32.8MB/s), 31.2MiB/s-31.2MiB/s (32.8MB/s-32.8MB/s), io=64.0KiB (65.5kB), run=2-2msec

Disk stats (read/write):
  nvme1n1: ios=0/0, sectors=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%